admin/app/views/team_members/index.html.erb

SELECT "team_members".* FROM "team_members"
---
                    <th>
            <%= t("activerecord.attributes.team_member.firstname", :default => t("activerecord.labels.firstname", :default => "Firstname")) %>