admin/app/views/teams/show.html.erb

SELECT "team_members".* FROM "team_members" WHERE ("team_members".team_id = 2)
SELECT COUNT(*) FROM "team_members" WHERE ("team_members".team_id = 2)
---

<% if !@team.team_members.empty? %>