admin/app/views/teams/show.html.erb

        <p>
          <b><%= t("activerecord.attributes.team.country", :default => t("activerecord.labels.country", :default => "Country")) %>:</b>
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = 1 LIMIT 1