admin/app/controllers/team_members_controller.rb

  def index
    if params[:filter] && !params[:filter].empty?
      filters = ActiveSupport::JSON.decode(params[:filter])
      filters.each do |filter|
        @team_members = TeamMember.where(filter['property'] => filter['value'])
      end
    else
      @team_members = TeamMember.all
---
SELECT "team_members".* FROM "team_members" WHERE "team_members"."team_id" = 2
SELECT "team_members".* FROM "team_members"

  def show
    @team_member = TeamMember.find(params[:id])
---
SELECT "team_members".* FROM "team_members" WHERE "team_members"."id" = 1 LIMIT 1

  def create
    @team_member = TeamMember.new(params[:team_member])

    respond_to do |format|
      if @team_member.save
---
INSERT INTO "team_members" ("firstname", "lastname", "team_id", "created_at", "updated_at") VALUES ('Todd', 'Treece', 1, '2011-03-04 17:51:25.003065', '2011-03-04 17:51:25.003065')

  def update
    @team_member = TeamMember.find(params[:id])

    respond_to do |format|
      @team_member.firstname = params[:firstname]
      @team_member.lastname = params[:lastname]
      @team_member.team_id = params[:team_id]
      if @team_member.save
---
SELECT "team_members".* FROM "team_members" WHERE "team_members"."id" = 1 LIMIT 1
UPDATE "team_members" SET "team_id" = 2, "updated_at" = '2011-03-04 18:01:29.373888' WHERE "team_members"."id" = 1