admin/app/controllers/teams_controller.rb

INSERT INTO "teams" ("name", "city", "state", "country", "created_at", "updated_at") VALUES ('sd', '', '', '', '2011-03-04 17:32:22.007872', '2011-03-04 17:32:22.007872')
---
  def create
    @team = Team.new
    @team.name = params[:name]
    @team.city = params[:city]
    @team.state = params[:state]
    @team.country = params[:country]

    respond_to do |format|
      if @team.save