rails/app/controllers/bot_types_controller.rb

SELECT "bot_types".* FROM "bot_types"
---
  def index
    @bot_types = BotType.all

SELECT "bot_types".* FROM "bot_types" WHERE "bot_types"."id" = 1 LIMIT 1
---
  def show
    @bot_type = BotType.find(params[:id])