rails/app/controllers/teams_controller.rb

INSERT INTO "teams" ("name", "city", "state", "country", "created_at", "updated_at") VALUES ('sd', '', '', '', '2011-03-04 17:32:22.007872', '2011-03-04 17:32:22.007872')
---
  def create
    @team = Team.new(params[:team])

    respond_to do |format|
      if @team.save