rails/app/controllers/team_members_controller.rb

SELECT "team_members".* FROM "team_members"
---
  def index
    @team_members = TeamMember.all

SELECT "team_members".* FROM "team_members" WHERE "team_members"."id" = 1 LIMIT 1
---
  def show
    @team_member = TeamMember.find(params[:id])

INSERT INTO "team_members" ("firstname", "lastname", "team_id", "created_at", "updated_at") VALUES ('Todd', 'Treece', 1, '2011-03-04 17:51:25.003065', '2011-03-04 17:51:25.003065')
---
  def create
    @team_member = TeamMember.new(params[:team_member])

    respond_to do |format|
      if @team_member.save

SELECT "team_members".* FROM "team_members" WHERE "team_members"."id" = 1 LIMIT 1
UPDATE "team_members" SET "team_id" = 2, "updated_at" = '2011-03-04 18:01:29.373888' WHERE "team_members"."id" = 1
---
  def update
    @team_member = TeamMember.find(params[:id])

    respond_to do |format|
      if @team_member.update_attributes(params[:team_member])